Identifier: local.jamf.VagrantManager

Input:
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: ""
  CATEGORY: "Apps"
  DOWNLOAD_MISSING_FILE: ""
  GROUP_NAME: "%NAME%"
  GROUP_TEMPLATE: "JamfSmartGroupTemplate.xml"
  NAME: "Vagrant Manager"
  PACKAGE_INFO: "autopkg"
  POLICY_CATEGORY: "%CATEGORY%"
  POLICY_CUSTOM_TRIGGER: "install-%NAME%"
  POLICY_NAME: "%NAME%"
  POLICY_RUN_COMMAND: " "
  POLICY_RUN_RECON: "false"
  POLICY_TEMPLATE: "JamfPolicyTemplate_allcomputers.xml"
  REMOVE_OLD_PACKAGES: "true"
  REPLACE_CATEGORY: "true"
  REPLACE_POLICY: "true"
  SELF_SERVICE_AVAILABLE: "true"
  SELF_SERVICE_CATEGORY: "%CATEGORY%"
  SELF_SERVICE_DESCRIPTION: "Create and configure lightweight, reproducible, and portable development environments."
  SELF_SERVICE_DISPLAY_NAME: "%NAME%"
  SELF_SERVICE_ICON: "%NAME%.png"
  SELF_SERVICE_INSTALL_BUTTON: "Install"
  SELF_SERVICE_REINSTALL_BUTTON: "Install"
  SOFTWARE_TITLE: "%NAME%"
  UPDATE_PREDICATE: "pkg_uploaded == False"

ParentRecipe: com.github.adtejaa.jamf.VagrantManager

ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py"
      sha256_hash: "04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e"
    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py"
      sha256_hash: "aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d"
    com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageCleaner.py"
      sha256_hash: "798a179894e6bcc3be65ab6d587bec775e4cfc459956e402f198bb639833365c"
    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py"
      sha256_hash: "0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95"
    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py"
      sha256_hash: "5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124"

  parent_recipes:
    com.github.adtejaa.jamf.VagrantManager:
      git_hash: "b40b14771dd0a654f495648bd6f92573ed8476d8"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/VagrantManager/VagrantManager.jamf.recipe.yaml"
      sha256_hash: "ce35d0aa200c3c5372204ae197f855108c703c8ad4fad92b1c0486d05e61d26d"
    com.github.adtejaa.pkg.VagrantManager:
      git_hash: "df69ed059c64da88ec59ffa4d7a9fddf4311f09b"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/VagrantManager/VagrantManager.pkg.recipe.yaml"
      sha256_hash: "7834121aa3071843ca86903f52cdf9fb1dcf06da559e22ef03226f07c19b64f1"
    com.github.gerardkok.download.VagrantManager:
      git_hash: "98e0d69732d9c4bd439c1d7cfce614381abf6679"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.gerardkok-recipes/VagrantManager/VagrantManager.download.recipe"
      sha256_hash: "2dcd009d4c2ffd38b29747e31dc07187d10450b56b71081bf49f1e4ea3ba0477"
