Identifier: local.jamf.Axure
Input:
  BASE_URL: "https://axure.cachefly.net/versions"
  CATEGORY: "Development"
  GROUP_NAME: "%NAME%"
  GROUP_TEMPLATE: "JamfSmartGroupTemplate.xml"
  MAJOR_VERSION: "9"
  NAME: "Axure RP %MAJOR_VERSION%"
  POLICY_CATEGORY: "Development"
  POLICY_NAME: "%NAME%"
  POLICY_TEMPLATE: "JamfPolicyTemplate.xml"
  SELF_SERVICE_DESCRIPTION: "Axure RP is the only UX tool that gives UX professionals the power to build realistic, functional prototypes."
  SELF_SERVICE_ICON: "Axure.png"
  UPDATE_PREDICATE: "pkg_uploaded == False"
  replace_pkg: True
  replace_policy: True
  replace_group: True
  replace_category: True

ParentRecipe: com.github.adtejaa.axure

ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py"
      sha256_hash: "04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e"

    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py"
      sha256_hash: "aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d"

    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py"
      sha256_hash: "0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95"

    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py"
      sha256_hash: "5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124"

  parent_recipes:
    com.github.adtejaa.axure:
      git_hash: "5ce2f050015212bf4cfe0b00c5b0af10fb41b04d"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/Axure/Axure.jamf.recipe.yaml"
      sha256_hash: "2589a6b1e5bd3b78515a8fec352075978ea6cddd9e3bb983c7e6567730bb9939"
