Identifier: local.jamf.Axure-Latest
Input:
  BASE_URL: "https://axure.cachefly.net"
  CATEGORY: "Development"
  DOWNLOAD_URL: "https://axure.cachefly.net/AxureRP-Setup.dmg"
  GROUP_NAME: "%NAME%"
  GROUP_TEMPLATE: "JamfSmartGroupTemplate.xml"
  MAJOR_VERSION: "11"
  NAME: "Axure RP %MAJOR_VERSION%"
  POLICY_CATEGORY: "%CATEGORY%"
  POLICY_NAME: "%NAME%"
  POLICY_TEMPLATE: "JamfPolicyTemplate.xml"
  SELF_SERVICE_DESCRIPTION: "Axure RP is the only UX tool that gives UX professionals the power to build realistic, functional prototypes."
  SELF_SERVICE_ICON: "Axure.png"
  UPDATE_PREDICATE: "pkg_uploaded == False"


ParentRecipe: "com.github.adtejaa.axure-latest"

ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py"
      sha256_hash: "04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e"

    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py"
      sha256_hash: "aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d"

    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py"
      sha256_hash: "0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95"

    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py"
      sha256_hash: "5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124"

  parent_recipes:
    com.github.adtejaa.axure-latest:
      git_hash: "3b8dd7b8eb5dff7d1e363b710faf91856b0ce7c6"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/Axure/Axure-Latest.jamf.recipe.yaml"
      sha256_hash: "8a8a43779d3aa39607beb5e9f6b2a9de7a413e93ee6cf526f494ba9481b30343"
