Identifier: local.jamf.MacTeX
Input:
  CATEGORY: Apps
  DOWNLOADPAGE_URL: "http://www.tug.org/mactex/mactex-download.html"
  GROUP_NAME: "%NAME%"
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  NAME: MacTeX
  PACKAGE_INFO: autopkg
  POLICY_CATEGORY: Apps
  POLICY_CUSTOM_TRIGGER: "install-%NAME%"
  POLICY_NAME: "%NAME%"
  POLICY_RUN_COMMAND: " "
  POLICY_RUN_RECON: "false"
  POLICY_SCOPE_ALL_COMPUTERS: "true"
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  REMOVE_OLD_PACKAGES: "true"
  REPLACE_CATEGORY: "true"
  REPLACE_GROUP: "true"
  REPLACE_POLICY: "true"
  SELF_SERVICE_AVAILABLE: "true"
  SELF_SERVICE_CATEGORY: "%CATEGORY%"
  SELF_SERVICE_DESCRIPTION: |
    MacTeX provides a full TeX distribution for macOS, 
    including LaTeX, TeX Live, and additional utilities.
  SELF_SERVICE_DISPLAY_NAME: "%NAME%"
  SELF_SERVICE_ICON: "%SOFTWARE_TITLE%.png"
  SELF_SERVICE_INSTALL_BUTTON: Install
  SELF_SERVICE_REINSTALL_BUTTON: Reinstall
  SOFTWARE_TITLE: MacTeX
  UPDATE_PREDICATE: "pkg_uploaded == false"

ParentRecipe: com.github.adtejaa.jamf.MacTeX
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py"
      sha256_hash: "04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e"

    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py"
      sha256_hash: "aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d"

    com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageCleaner.py"
      sha256_hash: "798a179894e6bcc3be65ab6d587bec775e4cfc459956e402f198bb639833365c"

    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py"
      sha256_hash: "0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95"

    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py"
      sha256_hash: "5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124"

    com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult:
      git_hash: "793b25dfbe9be8cbc507516d5c8818983357ff5b"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/PostProcessors/LastRecipeRunResult.py"
      sha256_hash: "fcaf0e995aaaa0b633425865546facf544d99b38e5988d5003d33604f27cb9ab"

  parent_recipes:
    com.github.adtejaa.download.MacTeX:
      git_hash: "04c3ebc1b452d472b2fc1491333ea16c0b7f3515"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/MacTeX/MacTeX.download.recipe.yaml"
      sha256_hash: "775f4b3ac07a844c38104ab09aa20b660179fda4ef94768b24bdf9b496863d21"

    com.github.adtejaa.jamf.MacTeX:
      git_hash: "0114e8217c35258d9aef151240349356be29ff25"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/MacTeX/MacTex.jamf.recipe.yaml"
      sha256_hash: "aa240ebe66021b164b8e42d5771d99344fe23fce0c7b54285e0e0cbb8d310326"

    com.github.adtejaa.pkg.MacTeX:
      git_hash: "c62704fe4c24405ac6904d0647a07f742e55f537"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/MacTeX/MacTeX.pkg.recipe.yaml"
      sha256_hash: "a9d919ee3143233f803ff2b5074d1b89128e11a39757831d619a67b56b29b972"
