Identifier: local.jamf.TableauDesktop
Input:
  CATEGORY: "Apps"
  DOWNLOAD_URL: "https://www.tableau.com/downloads/desktop/mac"
  GROUP_NAME: "%NAME%"
  GROUP_TEMPLATE: "JamfSmartGroupTemplate.xml"
  NAME: "Tableau Desktop"
  PACKAGE_INFO: "autopkg"
  POLICY_CATEGORY: "Apps"
  POLICY_CUSTOM_TRIGGER: "install-%NAME%"
  POLICY_NAME: "%NAME%"
  POLICY_RUN_COMMAND: " "
  POLICY_RUN_RECON: "false"
  POLICY_SCOPE_ALL_COMPUTERS: "true"
  POLICY_TEMPLATE: "JamfPolicyTemplate.xml"
  REMOVE_OLD_PACKAGES: "true"
  REPLACE_CATEGORY: "true"
  REPLACE_GROUP: "true"
  REPLACE_POLICY: "true"
  SELF_SERVICE_AVAILABLE: "true"
  SELF_SERVICE_CATEGORY: "%CATEGORY%"
  SELF_SERVICE_DESCRIPTION: |
    Tableau Desktop empowers users to create, analyze, and visualize data with interactive dashboards and reports, making data-driven decision-making easy.
  SELF_SERVICE_DISPLAY_NAME: "%NAME%"
  SELF_SERVICE_ICON: "%SOFTWARE_TITLE%.png"
  SELF_SERVICE_INSTALL_BUTTON: "Install"
  SELF_SERVICE_REINSTALL_BUTTON: "Install"
  SOFTWARE_TITLE: "%NAME%"
  UPDATE_PREDICATE: "pkg_uploaded == False"

ParentRecipe: "com.github.adtejaa.jamf.Tableau-Desktop"
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py"
      sha256_hash: "04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e"

    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py"
      sha256_hash: "aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d"

    com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageCleaner.py"
      sha256_hash: "798a179894e6bcc3be65ab6d587bec775e4cfc459956e402f198bb639833365c"

    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py"
      sha256_hash: "0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95"

    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py"
      sha256_hash: "5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124"

    com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult:
      git_hash: "793b25dfbe9be8cbc507516d5c8818983357ff5b"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/PostProcessors/LastRecipeRunResult.py"
      sha256_hash: "fcaf0e995aaaa0b633425865546facf544d99b38e5988d5003d33604f27cb9ab"

  parent_recipes:
    com.github.adtejaa.jamf.Tableau-Desktop:
      git_hash: "709cd61e7cbfcda047b57be0899ddf5d168dc742"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/TableauDesktop/TableauDesktop.jamf.recipe.yaml"
      sha256_hash: "2d36d65a408e6bd3047f4b420adb0bb83deaa012ea954823dfeed35de7bb2939"

    com.github.gmarnin.download.tableau-desktop:
      git_hash: "4d88bf7e0abd7ba49e17bba4d3df93da2b5ba8dc"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.gmarnin-recipes/Tableau/Tableau.download.recipe"
      sha256_hash: "3bb9619ae20b1c1ce4b293d54a508b078ebadeea0f4270c466b1ebde01d19247"

    com.github.gmarnin.pkg.tableau-desktop:
      git_hash: "35c0c85468c426e277469d77f38e691479f8910a"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.gmarnin-recipes/Tableau/Tableau.pkg.recipe"
      sha256_hash: "fed9874977d91c9da00f5eb9c3d5ba975dd592f05c5762313369fcf4f467464f"
