Identifier: local.jamf.Neo4j-CE
Input:
  CATEGORY: "Apps"
  DOWNLOAD_PAGE_URL: "https://neo4j.com/deployment-center/"
  GROUP_NAME: "%NAME%"
  GROUP_TEMPLATE: "JamfSmartGroupTemplate.xml"
  NAME: "Neo4j Desktop"
  PACKAGE_INFO: "autopkg"
  POLICY_CATEGORY: "Apps"
  POLICY_CUSTOM_TRIGGER: "install-%NAME%"
  POLICY_NAME: "%NAME%"
  POLICY_RUN_COMMAND: " "
  POLICY_RUN_RECON: "false"
  POLICY_SCOPE_ALL_COMPUTERS: "true"
  POLICY_TEMPLATE: "JamfPolicyTemplate.xml"
  REMOVE_OLD_PACKAGES: "true"
  REPLACE_CATEGORY: "true"
  REPLACE_GROUP: "true"
  REPLACE_POLICY: "true"
  SELF_SERVICE_AVAILABLE: "true"
  SELF_SERVICE_CATEGORY: "%CATEGORY%"
  SELF_SERVICE_DESCRIPTION: |
    Neo4j Desktop is an integrated development environment (IDE) for managing Neo4j databases.
    It provides a user-friendly interface to create, explore, and manage graph-based data efficiently.
  SELF_SERVICE_DISPLAY_NAME: "%NAME%"
  SELF_SERVICE_ICON: "%SOFTWARE_TITLE%.png"
  SELF_SERVICE_INSTALL_BUTTON: "Install"
  SELF_SERVICE_REINSTALL_BUTTON: "Reinstall"
  SOFTWARE_TITLE: "Neo4j Desktop"
  UPDATE_PREDICATE: "pkg_uploaded == False"

ParentRecipe: "com.github.adtejaa.jamf.Neo4jDesktop"
ParentRecipeTrustInfo:

Process:
  # 🟢 1. Ensure Category Exists Before Upload
  - Processor: "com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader"
    Arguments:
      category_name: "%CATEGORY%"
      replace_category: "%REPLACE_CATEGORY%"

  # 🟢 2. Ensure Computer Group Exists **Before Policy Upload**
  - Processor: "com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader"
    Arguments:
      computergroup_name: "%GROUP_NAME%"
      computergroup_template: "%GROUP_TEMPLATE%"
      replace_group: "%REPLACE_GROUP%"

  # 🟢 3. Upload Package
  - Processor: "com.github.grahampugh.jamf-upload.processors/JamfPackageUploader"
    Arguments:
      pkg_category: "%CATEGORY%"
      pkg_info: "%PACKAGE_INFO%"

  # 🟢 4. Upload Policy **After Group Exists**
  - Processor: "com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader"
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELF_SERVICE_ICON%"
      replace_policy: "%REPLACE_POLICY%"

  # 🟢 5. Log Last Recipe Run Result
  - Processor: "com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult"

  # 🟢 6. Remove Old Packages (Only If Necessary)
  - Processor: "StopProcessingIf"
    Arguments:
      predicate: "%REMOVE_OLD_PACKAGES% == false"

  - Processor: "com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner"
    Arguments:
      pkg_name_match: "%SOFTWARE_TITLE%-"
      versions_to_keep: 2

  # 🟢 7. Final Stop Processing Check
  - Processor: "StopProcessingIf"
    Arguments:
      predicate: "pkg_uploaded == False"
