Identifier: local.jamf.VMWareFusion

Input:
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: null
  CATEGORY: Apps
  DOWNLOAD_MISSING_FILE: null
  GROUP_NAME: "VMWare Fusion"
  GROUP_TEMPLATE: "JamfSmartGroupTemplate.xml"
  NAME: "VMWare Fusion"
  PACKAGE_INFO: autopkg
  POLICY_CATEGORY: "%CATEGORY%"
  POLICY_CUSTOM_TRIGGER: "install-%NAME%"
  POLICY_NAME: "VMwareFusion"
  POLICY_RUN_COMMAND: " "
  POLICY_RUN_RECON: "false"
  POLICY_TEMPLATE: "JamfPolicyTemplate_allcomputers.xml"
  REMOVE_OLD_PACKAGES: "true"
  REPLACE_CATEGORY: "true"
  REPLACE_GROUP: "true"
  REPLACE_POLICY: "true"
  SELF_SERVICE_AVAILABLE: "true"
  SELF_SERVICE_CATEGORY: "%CATEGORY%"
  SELF_SERVICE_DESCRIPTION: "VMware Fusion allows users to run Windows, Linux, and other operating systems on macOS without rebooting."
  SELF_SERVICE_DISPLAY_NAME: "VMwareFusion"
  SELF_SERVICE_ICON: "VMwareFusion.png"
  SELF_SERVICE_INSTALL_BUTTON: "Install"
  SELF_SERVICE_REINSTALL_BUTTON: "Install"
  SOFTWARE_TITLE: "VMWare Fusion"
  UPDATE_PREDICATE: "pkg_uploaded == False"

ParentRecipe: com.github.adtejaa.jamf.VMwareFusion

ParentRecipeTrustInfo:
  non_core_processors:
    VMwareFusionURLProvider:
      git_hash: "c708dc0fa00df700e96ca41a84e8f57d9a64d1bf"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.justinrummel-recipes/VMware Fusion/VMwareFusionURLProvider.py"
      sha256_hash: "905527137b2da07120093b77606f1ce74268b5c4f80020ae7a68f3231568964f"

    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py"
      sha256_hash: "04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e"

    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py"
      sha256_hash: "aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d"

    com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageCleaner.py"
      sha256_hash: "798a179894e6bcc3be65ab6d587bec775e4cfc459956e402f198bb639833365c"

    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py"
      sha256_hash: "0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95"

    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py"
      sha256_hash: "5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124"

    com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult:
      git_hash: "793b25dfbe9be8cbc507516d5c8818983357ff5b"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/PostProcessors/LastRecipeRunResult.py"
      sha256_hash: "fcaf0e995aaaa0b633425865546facf544d99b38e5988d5003d33604f27cb9ab"

parent_recipes:
  com.github.adtejaa.jamf.VMwareFusion:
    git_hash: "26c083e97276dea0abf10f27f5440cc71486f00e"
    path: "~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/VMWareFusion/VMWareFusion.jamf.recipe.yaml"
    sha256_hash: "4afdec29e440d9eb215f9648e297a6e29ed7b3f8743f7e7ec1c080e1d64543c3"

  com.justinrummel.download.VMwareFusion:
    git_hash: "069d6bc8ff426e5e2cd36e708769107017759fd6"
    path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.justinrummel-recipes/VMware Fusion/VMwareFusion.download.recipe"
    sha256_hash: "7bd5af1eb7616897e4fa76faf745b6a1e37bcbaf380c5615abb2bc90f4dee910"

  com.justinrummel.pkg.VMwareFusion:
    git_hash: "a406f32fe84432a4ae4de013b752a3423d49f1af"
    path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.justinrummel-recipes/VMware Fusion/VMwareFusion.pkg.recipe"
    sha256_hash: "cd68e2d661fa52212feab31dcc19b7cd762b7b6e0847eae83ccf17c266f186cf"
