Identifier: com.github.adtejaa.jamf.Firefox
Input:
  CATEGORY: Web Browsers and Internet Utilities
  GROUP_NAME: Firefox-update-smart
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  LATEST_RELEASE: LATEST_FIREFOX_VERSION
  LOCALE: en-US
  NAME: Firefox
  POLICY_CATEGORY: Testing
  POLICY_NAME: Install Latest %NAME%
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  SELF_SERVICE_DESCRIPTION: Firefox is a web browser from Mozilla.
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_ICON: "%NAME%.png"
  SOFTWARETITLE: Firefox
  TESTING_GROUP_NAME: Testing
  UPDATE_PREDICATE: pkg_uploaded == False
  VENDOR: Mozilla
ParentRecipe: com.github.autopkg.grahampugh-recipes.jamf.Firefox
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py
      sha256_hash: aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d
    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py
      sha256_hash: 0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95
    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py
      sha256_hash: 5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124
  parent_recipes:
    com.github.autopkg.download.FirefoxSignedPkg:
      git_hash: b8ebd97b7fc92cc4a9dc382ccc2ff8090c1b8f21
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Mozilla/FirefoxSignedPkg.download.recipe
      sha256_hash: 63a854b014f941e7c6a24714eab91310ca0d40b91ab33e609724f24e918be53f
    com.github.autopkg.grahampugh-recipes.jamf.Firefox:
      git_hash: ddc4c431ca9062a16d3cfd6f0039fcfb7a58e60e
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/Jamf_Recipes/Firefox.jamf.recipe
      sha256_hash: f155afb3322b3858cedb3f0fb108ba9013e9a3adf4129cd6c62edfdea12a2658
    com.github.rtrouton.pkg.Firefox:
      git_hash: b195cea242886d8350fcd06df3a0368e8a8dcd19
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/Firefox/Firefox.pkg.recipe
      sha256_hash: b0e97095f63138bbf4bcb53565280f956957b8871efd23c3f207588369fa5bc6
  Process:
  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: "%NAME%-"
      versions_to_keep: 2
