Identifier: local.jamf.HandBrake
Input:
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: ""
  CATEGORY: Digital Media
  DOWNLOAD_MISSING_FILE: ""
  GROUP_NAME: HandBrake-update-smart
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  NAME: HandBrake
  PACKAGE_INFO: autopkg
  POLICY_CATEGORY: "%CATEGORY%"
  POLICY_CUSTOM_TRIGGER: install-%NAME%
  POLICY_NAME: "%NAME%"
  POLICY_RUN_COMMAND: " "
  POLICY_RUN_RECON: "false"
  POLICY_TEMPLATE: JamfPolicyTemplate_allcomputers.xml
  PRERELEASE: ""
  REMOVE_OLD_PACKAGES: "true"
  REPLACE_CATEGORY: "true"
  REPLACE_POLICY: "true"
  SELF_SERVICE_AVAILABLE: "true"
  SELF_SERVICE_CATEGORY: "%CATEGORY%"
  SELF_SERVICE_DESCRIPTION: "HandBrake is a tool for converting video from nearly any format to a selection of modern, widely supported codecs."
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_ICON: "%NAME%.png"
  SELF_SERVICE_INSTALL_BUTTON: Install
  SELF_SERVICE_REINSTALL_BUTTON: Install
  SOFTWARE_TITLE: "%NAME%"
  TESTING_GROUP_NAME: Testing
  UPDATE_PREDICATE: pkg_uploaded == False

ParentRecipe: com.github.jamf.HandBrake
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py
      sha256_hash: 04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e
    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py
      sha256_hash: aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d
    com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageCleaner.py
      sha256_hash: 798a179894e6bcc3be65ab6d587bec775e4cfc459956e402f198bb639833365c
    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py
      sha256_hash: 0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95
    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py
      sha256_hash: 5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124
    com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult:
      git_hash: 793b25dfbe9be8cbc507516d5c8818983357ff5b
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/PostProcessors/LastRecipeRunResult.py
      sha256_hash: fcaf0e995aaaa0b633425865546facf544d99b38e5988d5003d33604f27cb9ab

  parent_recipes:
    com.github.autopkg.download.Handbrake:
      git_hash: 93d8f9c58313e2462659267a1ba53a22d36d7fa9
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Handbrake/Handbrake.download.recipe
      sha256_hash: c40d4e8024807e981269ed2725feb1a24030292fcad57aa089b92ef3e442d603
    com.github.autopkg.grahampugh-recipes.jamf.HandBrake:
      git_hash: a802b4b5c78a6b87e39db23ab31f34978dcf9772
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/Jamf_Recipes/HandBrake.jamf.recipe
      sha256_hash: d77df90a80a9ad8e971c2e0577fa4fd1efd6024e1b76c3dfe211688c4552e0c5
    com.github.autopkg.pkg.Handbrake:
      git_hash: f29f399c54adee7122e9fdc3c1ea7ed4c67388a4
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Handbrake/Handbrake.pkg.recipe
      sha256_hash: 9aebd03b9dc256d2c2807b49b9735febc2c6b4729c4a1d0c02b3be3111974a61
    com.github.jamf.HandBrake:
      git_hash: 156049cf113560a748cb79eaafd4d10b2bfa488c
      path: ~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/HandBrake/HandBrake.jamf.recipe.yaml
      sha256_hash: 47d602bdbaab67f1ad3944ce01102ee9ceef3a9e34300683b3a62be339d97457
