Identifier: "local.jamf.Principle"
Input:
  BUNDLE_ID: "com.danielhooper.principle"
  CATEGORY: "Apps"
  GROUP_NAME: "%NAME%"
  GROUP_TEMPLATE: "JamfSmartGroupTemplate.xml"
  NAME: "Principle"
  PACKAGE_INFO: "autopkg"
  POLICY_CATEGORY: "%CATEGORY%"
  POLICY_CUSTOM_TRIGGER: "install-%NAME%"
  POLICY_NAME: "%NAME%"
  POLICY_RUN_COMMAND: " "
  POLICY_RUN_RECON: 'false'
  POLICY_SCOPE_ALL_COMPUTERS: 'true'
  POLICY_TEMPLATE: "JamfPolicyTemplate_allcomputers.xml"
  REMOVE_OLD_PACKAGES: 'true'
  REPLACE_CATEGORY: 'true'
  REPLACE_GROUP: 'true'
  REPLACE_POLICY: 'true'
  SELF_SERVICE_AVAILABLE: "true"
  SELF_SERVICE_CATEGORY: "%CATEGORY%"
  SELF_SERVICE_DESCRIPTION: "Principle is a powerful animation and prototyping tool designed for UI/UX designers, allowing you to create interactive and animated app prototypes effortlessly."
  SELF_SERVICE_DISPLAY_NAME: "%NAME%"
  SELF_SERVICE_ICON: "%SOFTWARE_TITLE%.png"
  SELF_SERVICE_INSTALL_BUTTON: "Install"
  SELF_SERVICE_REINSTALL_BUTTON: "Install"
  SOFTWARE_TITLE: "Principle"
  SPARKLE_FEED_URL: "https://principleformac.com/update2.xml"
  UPDATE_PREDICATE: "pkg_uploaded == False"

ParentRecipe: "com.github.adtejaa.jamf.Principle"

ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py"
      sha256_hash: "04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e"

    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py"
      sha256_hash: "aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d"

    com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageCleaner.py"
      sha256_hash: "798a179894e6bcc3be65ab6d587bec775e4cfc459956e402f198bb639833365c"

    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py"
      sha256_hash: "0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95"

    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py"
      sha256_hash: "5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124"

    com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult:
      git_hash: "793b25dfbe9be8cbc507516d5c8818983357ff5b"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/PostProcessors/LastRecipeRunResult.py"
      sha256_hash: "fcaf0e995aaaa0b633425865546facf544d99b38e5988d5003d33604f27cb9ab"

  parent_recipes:
    com.github.adtejaa.jamf.Principle:
      git_hash: "c404a2ff1b765ae37a18bb300f705a15f3280eec"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/Principle/Principle.jamf.recipe.yaml"
      sha256_hash: "622f53d51e1f5a9fcfa2b8f1218125cb004f4a9c990e06465f9d234285fbb7af"

    com.github.jaharmi.download.Principle:
      git_hash: "06a90b3400bb3a8e6672330c10c775b402c18889"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.jaharmi-recipes/DanielHooper/Principle.download.recipe"
      sha256_hash: "90367a25f49099ca2d8483404e044da552a1d6e8488e9c3032aa2c63dadcb474"

    com.github.jaharmi.pkg.Principle:
      git_hash: "5b6f92528a456bbcfdf99ba0f004a3976081d363"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.jaharmi-recipes/DanielHooper/Principle.pkg.recipe"
      sha256_hash: "cc688d5767db0ac1298485d4338146e2565dfcae5626e312cf1b68112106c6c4"
