---
Identifier: local.jamf.intellijue
Input:
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: ''
  CATEGORY: Apps
  CSV_REQUIREMENT: >-
    identifier "com.jetbrains.intellij" and anchor apple generic and
    certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate
    leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate
    leaf[subject.OU] = "2ZEFAR8TH3"
  DOWNLOAD_MISSING_FILE: ''
  GROUP_NAME: '%NAME%'
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  NAME: IntelliJ IDEA
  PACKAGE_INFO: autopkg
  POLICY_CATEGORY: Apps
  POLICY_CUSTOM_TRIGGER: install-%NAME%
  POLICY_NAME: '%NAME%'
  POLICY_RUN_COMMAND: ' '
  POLICY_RUN_RECON: 'false'
  POLICY_SCOPE_ALL_COMPUTERS: 'true'
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  PRODUCT_CODE: IU
  REMOVE_OLD_PACKAGES: 'true'
  REPLACE_CATEGORY: 'true'
  REPLACE_GROUP: 'true'
  REPLACE_POLICY: 'true'
  SELF_SERVICE_AVAILABLE: 'true'
  SELF_SERVICE_CATEGORY: '%CATEGORY%'
  SELF_SERVICE_DESCRIPTION: >
    The IDE that makes development a more productive and enjoyable experience
  SELF_SERVICE_DISPLAY_NAME: '%NAME%'
  SELF_SERVICE_ICON: '%SOFTWARE_TITLE%.png'
  SELF_SERVICE_INSTALL_BUTTON: Install
  SELF_SERVICE_REINSTALL_BUTTON: Install
  SOFTWARE_TITLE: IntelliJ_IDEA
  UPDATE_PREDICATE: pkg_uploaded == False

ParentRecipe: com.github.adtejaa.jamf.IntelliJ_UE
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py
      sha256_hash: 04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e
    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py
      sha256_hash: aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d
    com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageCleaner.py
      sha256_hash: 798a179894e6bcc3be65ab6d587bec775e4cfc459956e402f198bb639833365c
    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py
      sha256_hash: 0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95
    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py
      sha256_hash: 5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124
    com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult:
      git_hash: 793b25dfbe9be8cbc507516d5c8818983357ff5b
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/PostProcessors/LastRecipeRunResult.py
      sha256_hash: fcaf0e995aaaa0b633425865546facf544d99b38e5988d5003d33604f27cb9ab
    com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged:
      git_hash: 6f55eec37d1217ed2956b57a90c1993ed4ddfa16
      path: ~/Library/AutoPkg/RecipeRepos/com.github.jgstew.jgstew-recipes/SharedProcessors/StopProcessingIfDownloadUnchanged.py
      sha256_hash: 2293abf8fcb2870f1b45e63a27d51a3364f72fc6c911631bb6ddfec8b6201726
    com.github.jgstew.SharedProcessors/URLDownloaderPython:
      git_hash: 8eaa294e961580527f351bb80ce0d03014d99bf3
      path: ~/Library/AutoPkg/RecipeRepos/com.github.jgstew.jgstew-recipes/SharedProcessors/URLDownloaderPython.py
      sha256_hash: 552f5d6f195cf9e56adb0146f14dc19d9480adb6f004f9cb66d68da339bc9e2b

  parent_recipes:
    com.github.adtejaa.download.IntelliJ_UE:
      git_hash: 8e5a47434dccd0b58d51a3240856cd51822c7e66
      path: ~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/IntelliJ-UE/intellijue.download.recipe.yaml
      sha256_hash: db65e44c2a73bfa2f6d4e32cc0cf86d4f62a627d1f0fcf43b4389028773ec7ca
    com.github.adtejaa.jamf.IntelliJ_UE:
      git_hash: 17b12b29d78670a1aeb2e0681a6d6b3052e246c2
      path: ~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/IntelliJ-UE/intellijue.jamf.recipe.yaml
      sha256_hash: 5457cdf828853d713921f0292e797278b509ec3c4d91ad300d703974edd5f0f9
    com.github.adtejaa.pkg.IntelliJ_UE:
      git_hash: 790a192384e5c0b373b646f23bf8c98f0d0b57c7
      path: ~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/IntelliJ-UE/intellijue.pkg.recipe.yaml
      sha256_hash: c75ac269c8450a1442e8f251965eb75281bd5bb8452b9f5de336bdd63e9464cf
    com.github.smithjw-actions.download.JetBrains:
      path: ~/Downloads/JetBrains.download.recipe.yaml
      sha256_hash: dd9e0656dc7302b4fc50fe721799b132f52870ce55d8433f83329cdfdc8fa75b
