Identifier: local.jamf.MySQLWorkBench
Input:
  ARCH: arm64
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: null
  CATEGORY: Developer
  NAME: MySQLWorkBench
  PACKAGE_INFO: autopkg
  POLICY_CATEGORY: '%CATEGORY%'
  POLICY_CUSTOM_TRIGGER: install-%NAME%
  POLICY_NAME: '%NAME%'
  POLICY_RUN_COMMAND: ' '
  POLICY_RUN_RECON: 'false'
  POLICY_TEMPLATE: JamfPolicyTemplate_allcomputers.xml
  REMOVE_OLD_PACKAGES: 'true'
  REPLACE_CATEGORY: 'true'
  REPLACE_POLICY: 'true'
  SELF_SERVICE_AVAILABLE: 'true'
  SELF_SERVICE_CATEGORY: '%CATEGORY%'
  SELF_SERVICE_DESCRIPTION: MySQL Workbench is a unified visual tool for database
    architects, developers, and DBAs.
  SELF_SERVICE_DISPLAY_NAME: '%NAME%'
  SELF_SERVICE_ICON: '%NAME%.png'
  SELF_SERVICE_INSTALL_BUTTON: Install
  SELF_SERVICE_REINSTALL_BUTTON: Install
  SOFTWARE_TITLE: '%NAME%'''
  UPDATE_PREDICATE: pkg_uploaded == False
ParentRecipe: com.github.autopkg.grahampugh-recipes.jamf.MySQLWorkBench
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py
      sha256_hash: 04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e
    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py
      sha256_hash: aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d
    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py
      sha256_hash: 0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95
    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py
      sha256_hash: 5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124
  parent_recipes:
    com.github.autopkg.grahampugh-recipes.jamf.MySQLWorkBench:
      git_hash: a802b4b5c78a6b87e39db23ab31f34978dcf9772
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/Jamf_Recipes/MySQLWorkBench.jamf.recipe
      sha256_hash: f6da58583858995ef01ab9e1cec03b0345ea8c037ccb5c4976601564a052a88e
    com.github.homebysix.download.MySQLWorkbench:
      git_hash: 2c8b1c89d7f3f2fa775ffb5ac5095171cdc5906b
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/MySQLWorkbench/MySQLWorkbench.download.recipe
      sha256_hash: 0d4d3b34a0b3874236ea43dc2f66cd185de381cac8d13a5e0fcc5b3a1530d5ee
    com.github.homebysix.pkg.MySQLWorkbench:
      git_hash: d7cb75eec5169d619771885b0698db421364316c
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/MySQLWorkbench/MySQLWorkbench.pkg.recipe
      sha256_hash: beb2cde8e01431061a56a33104b4af258894e2467326cb35f4b85d71e24ca173
Process:
- Arguments:
    category_name: '%CATEGORY%'
    replace_category: '%REPLACE_CATEGORY%'
  Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
- Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'
    replace_group: '%REPLACE_GROUP%'
  Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
- Arguments:
    pkg_category: '%CATEGORY%'
    pkg_info: '%PACKAGE_INFO%'
  Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
- Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    replace_policy: '%REPLACE_POLICY%'
  Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
- Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult
- Arguments:
    predicate: '%REMOVE_OLD_PACKAGES% == false'
  Processor: StopProcessingIf
- Arguments:
    pkg_name_match: '%SOFTWARE_TITLE%-'
    versions_to_keep: 2
  Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
- Arguments:
    predicate: pkg_uploaded == False
  Processor: StopProcessingIf
