Identifier: local.jamf.TableauPrepBuilder

Input:
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: ""
  CATEGORY: "Apps"
  DOWNLOAD_MISSING_FILE: ""
  DOWNLOAD_URL: "https://www.tableau.com/downloads/prep/mac"
  GROUP_NAME: "%NAME%"
  GROUP_TEMPLATE: "JamfSmartGroupTemplate.xml"
  NAME: "Tableau Prep Builder"
  PACKAGE_INFO: "autopkg"
  POLICY_CATEGORY: "Apps"
  POLICY_CUSTOM_TRIGGER: "install-%NAME%"
  POLICY_NAME: "%NAME%"
  POLICY_RUN_COMMAND: " "
  POLICY_RUN_RECON: "false"
  POLICY_SCOPE_ALL_COMPUTERS: "true"
  POLICY_TEMPLATE: "JamfPolicyTemplate.xml"
  REMOVE_OLD_PACKAGES: "true"
  REPLACE_CATEGORY: "true"
  REPLACE_GROUP: "true"
  REPLACE_POLICY: "true"
  SELF_SERVICE_AVAILABLE: "true"
  SELF_SERVICE_CATEGORY: "%CATEGORY%"
  SELF_SERVICE_DESCRIPTION: |
    Tableau Prep Builder simplifies data preparation with an intuitive interface, 
    allowing users to clean, shape, and combine data for analysis in Tableau Desktop.
  SELF_SERVICE_DISPLAY_NAME: "%NAME%"
  SELF_SERVICE_ICON: "%SOFTWARE_TITLE%.png"
  SELF_SERVICE_INSTALL_BUTTON: "Install"
  SELF_SERVICE_REINSTALL_BUTTON: "Install"
  SOFTWARE_TITLE: "%NAME%"
  UPDATE_PREDICATE: "pkg_uploaded == False"

ParentRecipe: com.github.adtejaa.jamf.tableau-prep

ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py"
      sha256_hash: "04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e"
    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py"
      sha256_hash: "aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d"
    com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageCleaner.py"
      sha256_hash: "798a179894e6bcc3be65ab6d587bec775e4cfc459956e402f198bb639833365c"
    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py"
      sha256_hash: "0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95"
    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py"
      sha256_hash: "5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124"
    com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult:
      git_hash: "793b25dfbe9be8cbc507516d5c8818983357ff5b"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/PostProcessors/LastRecipeRunResult.py"
      sha256_hash: "fcaf0e995aaaa0b633425865546facf544d99b38e5988d5003d33604f27cb9ab"

  parent_recipes:
    com.github.adtejaa.download.tableau-prep:
      git_hash: "2f85ef0203ee49e1785616987af1eca0c5be970e"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/TableauPrepBuilder/TableauPrepBuilder.download.recipe.yaml"
      sha256_hash: "9230fa33af44f131604c349767db367daf9f3b9d888022f9528bc6718a883563"
    com.github.adtejaa.jamf.tableau-prep:
      git_hash: "cd0b6bbc7ceebfea45e54b0939c136cf547e8ac6"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/TableauPrepBuilder/TableauPrepBuilder.jamf.recipe.yaml"
      sha256_hash: "984e230b3bad56c05cc8c2b265be37f365a3f7a6171e97d5d1a596e0428fb652"
    com.github.adtejaa.pkg.tableau-prep:
      git_hash: "ac3b6ad1820b07bcb16aa1759840557c63281f1f"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/TableauPrepBuilder/TableauPrepBuilder.pkg.recipe.yaml"
      sha256_hash: "bfeeb10aaf13b206ed438e721afcc97f713b53148ce6ece564111daec9aa0a1b"
