Identifier: local.jamf.Fork
Input:
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: ''
  CATEGORY: Apps
  DOWNLOAD_MISSING_FILE: ''
  GROUP_NAME: Fork-update-smart
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  NAME: Fork
  PACKAGE_INFO: autopkg
  POLICY_CATEGORY: '%CATEGORY%'
  POLICY_CUSTOM_TRIGGER: install-%NAME%
  POLICY_NAME: '%NAME%'
  POLICY_RUN_COMMAND: ' '
  POLICY_RUN_RECON: 'false'
  POLICY_TEMPLATE: JamfPolicyTemplate_allcomputers.xml
  REMOVE_OLD_PACKAGES: 'true'
  REPLACE_CATEGORY: 'true'
  REPLACE_POLICY: 'true'
  SELF_SERVICE_AVAILABLE: 'true'
  SELF_SERVICE_CATEGORY: '%CATEGORY%'
  SELF_SERVICE_DESCRIPTION: "Fork is a fast and friendly Git client for macOS and Windows, designed for intuitive version control with a sleek UI."
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_ICON: '%NAME%.png'
  SELF_SERVICE_INSTALL_BUTTON: Install
  SELF_SERVICE_REINSTALL_BUTTON: Install
  SOFTWARE_TITLE: '%NAME%'
  UPDATE_PREDICATE: pkg_uploaded == False

ParentRecipe: com.github.adtejaa.jamf.Fork
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: '~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py'
      sha256_hash: 04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e
    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: '~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py'
      sha256_hash: aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d
    com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: '~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageCleaner.py'
      sha256_hash: 798a179894e6bcc3be65ab6d587bec775e4cfc459956e402f198bb639833365c
    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: '~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py'
      sha256_hash: 0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95
    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: '~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py'
      sha256_hash: 5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124
    com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult:
      git_hash: 793b25dfbe9be8cbc507516d5c8818983357ff5b
      path: '~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/PostProcessors/LastRecipeRunResult.py'
      sha256_hash: fcaf0e995aaaa0b633425865546facf544d99b38e5988d5003d33604f27cb9ab
  parent_recipes:
    com.github.adtejaa.jamf.Fork:
      git_hash: 1739373d69c83e9d5559437f7f08ce521ab5471b
      path: '~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/Fork/Fork.jamf.recipe.yaml'
      sha256_hash: 0f872133d4fad7143918cee95c02686b3317bbfce334057f696a863d29954563
    io.github.hjuutilainen.download.Fork:
      git_hash: 8586d4846cd183b671a494e2fdf541a3ef0e97a4
      path: '~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hjuutilainen-recipes/Fork/Fork.download.recipe'
      sha256_hash: 5726050e227abc945edb011af5c5c310c140b54226245295dee3933fc0b2cf5f
    io.github.hjuutilainen.pkg.Fork:
      git_hash: 2bbf3031013cc16a4f7239840acac5df6da77d7e
      path: '~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hjuutilainen-recipes/Fork/Fork.pkg.recipe'
      sha256_hash: 0e229dcd93e9db99e3d935750154b9904be19e90073555619d5f10245cecd6ff
