Identifier: local.jamf.FileZilla
Input:
  CATEGORY: Apps
  GROUP_NAME: '%NAME%'
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  NAME: FileZilla
  PACKAGE_INFO: autopkg
  POLICY_CATEGORY: '%CATEGORY%'
  POLICY_CUSTOM_TRIGGER: 'install-%NAME%'
  POLICY_NAME: '%NAME%'
  POLICY_RUN_COMMAND: ' '
  POLICY_RUN_RECON: 'false'
  POLICY_SCOPE_ALL_COMPUTERS: 'true'
  POLICY_TEMPLATE: JamfPolicyTemplate_allcomputers.xml
  REMOVE_OLD_PACKAGES: 'true'
  REPLACE_CATEGORY: 'true'
  REPLACE_GROUP: 'true'
  REPLACE_POLICY: 'true'
  RE_PATTERN: '<a href="(?P<url>http[s]?.*?(?P<filename>FileZilla_(?P<version>[\d.]+)_macos-x86.*?\.tar\.bz2).*?)"'
  SELF_SERVICE_AVAILABLE: 'true'
  SELF_SERVICE_CATEGORY: '%CATEGORY%'
  SELF_SERVICE_DESCRIPTION: "FileZilla is a fast and reliable FTP, FTPS, and SFTP client with an intuitive interface. Easily transfer files between your computer and remote servers with advanced features like drag-and-drop support, bookmarking, and multi-threaded transfers."
  SELF_SERVICE_DISPLAY_NAME: '%NAME%'
  SELF_SERVICE_ICON: '%SOFTWARE_TITLE%.png'
  SELF_SERVICE_INSTALL_BUTTON: Install
  SELF_SERVICE_REINSTALL_BUTTON: Install
  SOFTWARE_TITLE: FileZilla
  UPDATE_PREDICATE: 'pkg_uploaded == False'

ParentRecipe: com.github.adtejaa.jamf.FileZilla
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: '~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py'
      sha256_hash: 04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e'
    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: '~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py'
      sha256_hash: aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d'
    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: '~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py'
      sha256_hash: 0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95'
    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: '~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py'
      sha256_hash: 5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124'
  parent_recipes:
    com.github.adtejaa.jamf.FileZilla:
      git_hash: 50945806e1e031bb0c5204f3b470ceb1cff83c3a
      path: '~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/FileZilla/FileZilla.jamf.recipe.yaml'
      sha256_hash: 42099bd3b69b227a864f0a071e9c5f37daacdf57838d7f1e3e91885ac65f44f7'
    com.github.keeleysam.recipes.FileZilla.download:
      git_hash: 0d2037f283554d5729b3bcb613506e73d9210865
      path: '~/Library/AutoPkg/RecipeRepos/com.github.autopkg.keeleysam-recipes/FileZilla/FileZilla.download.recipe'
      sha256_hash: ca2960623c80e62545f709fdf26aef42e8c438ff5ca9938320481bd401edcd63'
    com.github.scriptingosx.pkg.FileZilla:
      git_hash: b23ae29f333c3d2aeff100fdf430f4d6a65b9048
      path: '~/Library/AutoPkg/RecipeRepos/com.github.autopkg.scriptingosx-recipes/FileZilla/FileZilla.pkg.recipe'
      sha256_hash: cdee022dea311a1f96a26050fa8a1a138e573050fb598e28aeb455bfa386b503'
