Identifier: local.jamf.AzulZuluJava21

Input:
  NAME: AzulZuluJava21
  GROUP_NAME: '%NAME%'
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  POLICY_NAME: '%NAME%'
  version: "%version%"
  java_version: "%java_version%"
  SELF_SERVICE_ICON: "AzulZuluJava.jpg"

ParentRecipe: com.github.adtejaa.jamf.AzulZuluJava21

ParentRecipeTrustInfo:
  non_core_processors:
    AzulZuluJavaInfoProvider:
      git_hash: 8906177584f48a6ba2af5a2e5c97a5c47b797f79
      path: ~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/Azul/AzulZuluJavaInfoProvider.py
      sha256_hash: bdbf2182e7506c1c22526b9fca898a3754cd698baa65a97b9baf64a26624907e

    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py
      sha256_hash: 04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e

    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py
      sha256_hash: aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d

    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py
      sha256_hash: 0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95

    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py
      sha256_hash: 5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124

  parent_recipes:
    com.github.adtejaa.jamf.AzulZuluJava21:
      path: ~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/Azul/AzulZuluJava21.jamf.recipe.yaml
      sha256_hash: 34eba3f86a9d2871099644a241a5a2329af251c66ca63f56bec645d1ddf1311c
