Identifier: local.jamf.AzulZuluJava21

Input:
  ARCHITECTURE: arm
  BUNDLE_TYPE: jdk
  CATEGORY: Developer Tools
  DOWNLOAD_FILE_EXTENSION: dmg
  JAMF_CATEGORY: Developer Tools
  JAMF_PKG_INFO: |
    Azul Zulu builds of OpenJDK are open source, TCK-tested and certified builds of OpenJDK.
    Azul Zulu is available for a wide range of hardware platforms and operating systems.
  JAMF_PKG_NAME: "%NAME%"
  JAMF_PKG_NOTES: Generated and uploaded by AutoPkg
  JAMF_PKG_OS_REQUIREMENTS: ""
  JAMF_PKG_PRIORITY: "10"
  JAMF_PKG_REBOOT_REQUIRED: "False"
  JAMF_PKG_REPLACE: "False"
  JAMF_PKG_REPLACE_METADATA: "False"
  JAMF_PKG_REQUIRED_PROCESSOR: None
  JAMF_PKG_SEND_NOTIFICATION: "False"
  JAVA_MAJOR_VERSION: "21"
  NAME: AzulZuluJava
  POLICY_CATEGORY: "%CATEGORY%"
  POLICY_NAME: "Install %NAME% %version%"
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  POLICY_TRIGGER: Install_AzulZuluJava_%version%
  SELF_SERVICE_DESCRIPTION: WorkPlace.
  SELF_SERVICE_DISPLAY_NAME: "Install Latest %NAME%'"
  SELF_SERVICE_ICON: "%NAME%.png"
  UPDATE_PREDICATE: pkg_uploaded == True
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  GROUP_NAME: "%NAME% %version%"

ParentRecipe: com.github.adtejaa.jamf.AzulZuluJava21

ParentRecipeTrustInfo:
  non_core_processors:
    AzulZuluJavaInfoProvider:
      git_hash: 8906177584f48a6ba2af5a2e5c97a5c47b797f79
      path: ~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/Azul/AzulZuluJavaInfoProvider.py
      sha256_hash: bdbf2182e7506c1c22526b9fca898a3754cd698baa65a97b9baf64a26624907e

    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py
      sha256_hash: 04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e

    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py
      sha256_hash: aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d

    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py
      sha256_hash: 0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95

    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py
      sha256_hash: 5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124

  parent_recipes:
    com.github.adtejaa.jamf.AzulZuluJava21:
      git_hash: 1163aa42c24eef311f7d403a5a6bff0657d7213f
      path: ~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/Azul/AzulZuluJava21.jamf.recipe.yaml
      sha256_hash: 327d11e259160bdf7f87ef2fbbffec4ecd883ff147489ed460d45f74fd2d1557
