Identifier: local.jamf.Maccy
Input:
  CATEGORY: Apps
  GROUP_NAME: "%NAME%"
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  NAME: Maccy
  PACKAGE_INFO: autopkg
  POLICY_CATEGORY: "%CATEGORY%"
  POLICY_CUSTOM_TRIGGER: install-%NAME%
  POLICY_NAME: "%NAME%"
  POLICY_RUN_COMMAND: ""
  POLICY_RUN_RECON: false
  POLICY_SCOPE_ALL_COMPUTERS: true
  POLICY_TEMPLATE: JamfPolicyTemplate_allcomputers.xml
  REMOVE_OLD_PACKAGES: true
  REPLACE_CATEGORY: true
  REPLACE_GROUP: true
  REPLACE_POLICY: true
  SELF_SERVICE_AVAILABLE: true
  SELF_SERVICE_CATEGORY: "%CATEGORY%"
  SELF_SERVICE_DESCRIPTION: "A lightweight clipboard manager for macOS that keeps your clipboard history accessible and searchable for quick pasting."
  SELF_SERVICE_DISPLAY_NAME: "%NAME%"
  SELF_SERVICE_ICON: "%SOFTWARE_TITLE%.png"
  SELF_SERVICE_INSTALL_BUTTON: Install
  SELF_SERVICE_REINSTALL_BUTTON: Install
  SOFTWARETITLE: Maccy
  SOFTWARE_TITLE: Maccy
  UPDATE_PREDICATE: pkg_uploaded == False
ParentRecipe: com.github.adtejaa.jamf.Maccy
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py
      sha256_hash: 04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e
    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py
      sha256_hash: aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d
    com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageCleaner.py
      sha256_hash: 798a179894e6bcc3be65ab6d587bec775e4cfc459956e402f198bb639833365c
    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py
      sha256_hash: 0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95
    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py
      sha256_hash: 5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124
    com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult:
      git_hash: 793b25dfbe9be8cbc507516d5c8818983357ff5b
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/PostProcessors/LastRecipeRunResult.py
      sha256_hash: fcaf0e995aaaa0b633425865546facf544d99b38e5988d5003d33604f27cb9ab
  parent_recipes:
    com.github.adtejaa.jamf.Maccy:
      git_hash: b613b1f7229830b96ad21fd907bead64ca98da26
      path: ~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/Maccy/Maccy.jamf.recipe.yaml
      sha256_hash: 8e140a5c904aab17005607469aed499ab57be5fb4dc543441e9ebde359635d0e
    com.github.rtrouton.download.Maccy:
      git_hash: bac16a1280b499f2b5999f0c76cb2e3f784b5231
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/Maccy/Maccy.download.recipe
      sha256_hash: e33b1d5e6e88851a1a57c978a1279105965d29e914900623917f9d8fe4c090bc
    com.github.rtrouton.pkg.Maccy:
      git_hash: bac16a1280b499f2b5999f0c76cb2e3f784b5231
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/Maccy/Maccy.pkg.recipe
      sha256_hash: 92754f86d35d2de0be8bbdea9f69a7f8c819f2cdecd42e31182ab06eaaf85b03
