Identifier: local.jamf.OmnissaHorizonClient
Input:
  APPNAME: Omnissa Horizon Client
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: ''
  CATEGORY: Apps
  DOWNLOAD_MISSING_FILE: ''
  GROUP_NAME: Omnissa Horizon Client
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  HORIZON_MAJOR_VERSION: '8'
  NAME: Omnissa Horizon Client
  PACKAGE_INFO: autopkg
  POLICY_CATEGORY: '%CATEGORY%'
  POLICY_CUSTOM_TRIGGER: install-%NAME%
  POLICY_NAME: Omnissa Horizon Client
  POLICY_RUN_COMMAND: ' '
  POLICY_RUN_RECON: 'false'
  POLICY_TEMPLATE: JamfPolicyTemplate_allcomputers.xml
  REMOVE_OLD_PACKAGES: 'true'
  REPLACE_CATEGORY: 'true'
  REPLACE_GROUP: 'true'
  REPLACE_POLICY: 'true'
  SELF_SERVICE_AVAILABLE: 'true'
  SELF_SERVICE_CATEGORY: '%CATEGORY%'
  SELF_SERVICE_DESCRIPTION: Omnissa Horizon Client enables secure and seamless access to virtual desktops and applications from any device.
  SELF_SERVICE_DISPLAY_NAME: Omnissa Horizon Client
  SELF_SERVICE_ICON: OmnissaHorizonClient.png
  SELF_SERVICE_INSTALL_BUTTON: Install
  SELF_SERVICE_REINSTALL_BUTTON: Install
  SOFTWARETITLE1: Horizon
  SOFTWARETITLE2: Client
  SOFTWARE_TITLE: Omnissa Horizon Client
  UPDATE_PREDICATE: pkg_uploaded == False
  VENDOR: Omnissa

ParentRecipe: com.github.adtejaa.jamf.OmnissaHorizonClient
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py
      sha256_hash: 04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e
    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py
      sha256_hash: aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d
    com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageCleaner.py
      sha256_hash: 798a179894e6bcc3be65ab6d587bec775e4cfc459956e402f198bb639833365c
    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py
      sha256_hash: 0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95
    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py
      sha256_hash: 5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124
    com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult:
      git_hash: 793b25dfbe9be8cbc507516d5c8818983357ff5b
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/PostProcessors/LastRecipeRunResult.py
      sha256_hash: fcaf0e995aaaa0b633425865546facf544d99b38e5988d5003d33604f27cb9ab

  parent_recipes:
    com.github.adtejaa.jamf.OmnissaHorizonClient:
      git_hash: 5366157e140c6836b71cbb761fc815c98ce93d75
      path: ~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/OmnissaHorizonClient/Omnissa Horizon Client.jamf.recipe.yaml
      sha256_hash: 47d96b075c8548cd10668876d8cd9ec009cedb200ac2d4dd7df4e345f263ce55
    com.github.dataJAR-recipes.download.Omnissa Horizon Client:
      git_hash: af0c865c5ba677b9450a6575f2840b052c10a971
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.dataJAR-recipes/Omnissa Horizon Client/Omnissa Horizon Client.download.recipe
      sha256_hash: 6bb1d51be525430976239006e1eedb4c0ed0c752af6c5e97fda109f68f431d7d
    com.github.rtrouton.pkg.OmnissaHorizonClient:
      git_hash: 5470dd80a972652161d82c04d72a2d92fab81a7e
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/OmnissaHorizonClient/OmnissaHorizonClient.pkg.recipe
      sha256_hash: 7568df38db7f1f8524f052a3aa65d006e364206dcc8bfcd2f0f6374ba2a50351
