Identifier: local.jamf.MacPass
Input:
  CATEGORY: Apps
  GROUP_NAME: "%NAME%"
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  NAME: MacPass
  PACKAGE_INFO: autopkg
  POLICY_CATEGORY: "%CATEGORY%"
  POLICY_CUSTOM_TRIGGER: install-%NAME%
  POLICY_NAME: "%NAME%"
  POLICY_RUN_COMMAND: ""
  POLICY_RUN_RECON: false
  POLICY_SCOPE_ALL_COMPUTERS: true
  POLICY_TEMPLATE: JamfPolicyTemplate_allcomputers.xml
  REMOVE_OLD_PACKAGES: true
  REPLACE_CATEGORY: true
  REPLACE_GROUP: true
  REPLACE_POLICY: true
  SELF_SERVICE_AVAILABLE: true
  SELF_SERVICE_CATEGORY: "%CATEGORY%"
  SELF_SERVICE_DESCRIPTION: "The IDE that makes development a more productive and enjoyable experience"
  SELF_SERVICE_DISPLAY_NAME: "%NAME%"
  SELF_SERVICE_ICON: "%SOFTWARE_TITLE%.png"
  SELF_SERVICE_INSTALL_BUTTON: Install
  SELF_SERVICE_REINSTALL_BUTTON: Install
  SOFTWARE_TITLE: MacPass
  UPDATE_PREDICATE: pkg_uploaded == False

  
ParentRecipe: com.github.adtejaa.jamf.MacPass
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py
      sha256_hash: 04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e
    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py
      sha256_hash: aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d
    com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageCleaner.py
      sha256_hash: 798a179894e6bcc3be65ab6d587bec775e4cfc459956e402f198bb639833365c
    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py
      sha256_hash: 0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95
    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py
      sha256_hash: 5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124
    com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult:
      git_hash: 793b25dfbe9be8cbc507516d5c8818983357ff5b
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/PostProcessors/LastRecipeRunResult.py
      sha256_hash: fcaf0e995aaaa0b633425865546facf544d99b38e5988d5003d33604f27cb9ab
  parent_recipes:
    com.github.adtejaa.jamf.MacPass:
      git_hash: 2a4586043c1d6a534ccc5c3e8874e57e233fbcbb
      path: ~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/MacPass/MacPass.jamf.recipe.yaml
      sha256_hash: 56325bcabd705dcd76008050c176ffe3beb3f40cbd71e81082595986ca9e31df
    com.github.michalmmac.download.MacPass:
      git_hash: 9b0c0e02290656fca121c7eb8f94844d43f5f711
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.MichalMMac-recipes/MacPass/MacPass.download.recipe
      sha256_hash: 0e5ecf7ad2321ffa0dfa5cc8874cc1a0c2da527c2414d39ee4cceb0d9e0abf50
    com.github.michalmmac.pkg.MacPass:
      git_hash: 444fcc57a094c0e144c7a8ab7b9eaaaf069beb72
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.MichalMMac-recipes/MacPass/MacPass.pkg.recipe
      sha256_hash: 184f6c6fd07cf4891a02d32be2a6f74fcfb3c937973c78717f419a29ef4ce095
