Identifier: local.jamf.NodeJS
Input:
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: null
  CATEGORY: Developer
  DOWNLOAD_PATTERN: node-v([0-9\.]+).pkg
  DOWNLOAD_URL: https://nodejs.org/dist/latest/
  NAME: NodeJS
  PACKAGE_INFO: autopkg
  POLICY_CATEGORY: Apps
  POLICY_CUSTOM_TRIGGER: install-%NAME%
  POLICY_NAME: '%NAME%'
  POLICY_RUN_COMMAND: ' '
  POLICY_RUN_RECON: 'false'
  POLICY_SCOPE_ALL_COMPUTERS: 'true'
  POLICY_TEMPLATE: JamfPolicyTemplate_allcomputers.xml
  REMOVE_OLD_PACKAGES: 'true'
  REPLACE_CATEGORY: 'true'
  REPLACE_POLICY: 'true'
  SELF_SERVICE_AVAILABLE: 'true'
  SELF_SERVICE_CATEGORY: '%CATEGORY%'
  SELF_SERVICE_DESCRIPTION: ''
  SELF_SERVICE_DISPLAY_NAME: '%NAME%'
  SELF_SERVICE_ICON: '%NAME%.png'
  SELF_SERVICE_INSTALL_BUTTON: Install
  SELF_SERVICE_REINSTALL_BUTTON: Install
  SOFTWARE_TITLE: '%NAME%'
  UPDATE_PREDICATE: pkg_uploaded == False
ParentRecipe: com.github.autopkg.grahampugh-recipes.jamf.NodeJS
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py
      sha256_hash: 04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e
    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py
      sha256_hash: aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d
    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py
      sha256_hash: 0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95
    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py
      sha256_hash: 5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124
  parent_recipes:
    com.github.autopkg.grahampugh-recipes.jamf.NodeJS:
      git_hash: a802b4b5c78a6b87e39db23ab31f34978dcf9772
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/Jamf_Recipes/NodeJS.jamf.recipe
      sha256_hash: df49e562152b32618553d0e54415430ba44c9d5e9d9ddc0eb8762686cb351835
    com.github.novaksam.download.NodeJS:
      git_hash: 0d173f7ee3e80d71bd3d698045e3646da1817bfc
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.novaksam-recipes/Recipes
        - Download/NodeJS.download.recipe
      sha256_hash: 0b2d7fb9026159f377d66166147d4825a2674c96d4aef0ab03e728bc5beab9f8
    com.github.novaksam.pkg.NodeJS:
      git_hash: 0d173f7ee3e80d71bd3d698045e3646da1817bfc
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.novaksam-recipes/Recipes
        - pkg/NodeJS.pkg.recipe
      sha256_hash: a888b6d93acae47c7a4eccede3bf4e3a7f84f0d8b4df0526ce9d0bd4c58f67db
Process:
- Arguments:
    category_name: '%CATEGORY%'
    replace_category: '%REPLACE_CATEGORY%'
  Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
- Arguments:
    pkg_category: '%CATEGORY%'
    pkg_info: '%PACKAGE_INFO%'
  Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
- Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    replace_policy: '%REPLACE_POLICY%'
  Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
- Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult
- Arguments:
    predicate: '%REMOVE_OLD_PACKAGES% == false'
  Processor: StopProcessingIf
- Arguments:
    pkg_name_match: '%SOFTWARE_TITLE%-'
    versions_to_keep: 2
  Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
- Arguments:
    predicate: pkg_uploaded == False
  Processor: StopProcessingIf
