Identifier: local.jamf.VLC
Input:
  ARCHITECTURE: universal
  CATEGORY: Media
  GROUP_NAME: "%NAME%"
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  NAME: VLC
  PACKAGE_INFO: autopkg
  POLICY_CATEGORY: "%CATEGORY%"
  POLICY_CUSTOM_TRIGGER: "install-%NAME%"
  POLICY_NAME: "%NAME%"
  POLICY_RUN_COMMAND: " "
  POLICY_SCOPE_ALL_COMPUTERS: true
  POLICY_TEMPLATE: JamfPolicyTemplate_allcomputers.xml
  REMOVE_OLD_PACKAGES: true
  REPLACE_CATEGORY: true
  REPLACE_GROUP: true
  REPLACE_POLICY: true
  SELF_SERVICE_AVAILABLE: true
  SELF_SERVICE_CATEGORY: "%CATEGORY%"
  SELF_SERVICE_DESCRIPTION: "Install the latest version of VLC."
  SELF_SERVICE_DISPLAY_NAME: "%NAME%"
  SELF_SERVICE_ICON: "%NAME%.png"
  SELF_SERVICE_INSTALL_BUTTON: Install
  SELF_SERVICE_REINSTALL_BUTTON: Install
  SOFTWARE_TITLE: "%NAME%"
  TESTING_GROUP_NAME: Testing
  UPDATE_PREDICATE: pkg_uploaded == False

ParentRecipe: com.github.adtejaa.jamf.VLC
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py
      sha256_hash: 04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e
    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py
      sha256_hash: aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d
    com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageCleaner.py
      sha256_hash: 798a179894e6bcc3be65ab6d587bec775e4cfc459956e402f198bb639833365c
    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py
      sha256_hash: 0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95
    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py
      sha256_hash: 5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124
    com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult:
      git_hash: 793b25dfbe9be8cbc507516d5c8818983357ff5b
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/PostProcessors/LastRecipeRunResult.py
      sha256_hash: fcaf0e995aaaa0b633425865546facf544d99b38e5988d5003d33604f27cb9ab

  parent_recipes:
    com.github.adtejaa.jamf.VLC:
      git_hash: 6084ae74f3af0001431bae0cfb47abe40591e704
      path: ~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/VLC/VLC.jamf.recipe.yaml
      sha256_hash: 2d151ab93399c6190b1a47a9353f53a2e688b019903a4964ec1681b164d982ea
    com.github.autopkg.download.VLC:
      git_hash: 1b4ba2cfe6d1f6de304bc9c29b57df6602b2e7e6
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/VLC/VLC.download.recipe
      sha256_hash: e74a96c65488d34aabb247c171b57db7fed8afd67b61fffdce8f46bc54d35f18
    com.github.autopkg.grahampugh-recipes.jamf.VLC:
      git_hash: a802b4b5c78a6b87e39db23ab31f34978dcf9772
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/Jamf_Recipes/VLC.jamf.recipe
      sha256_hash: eb846a083e8f49cc462785b7fcc850b3464fc1ef81cb96505d6d9bfebcad176a
    com.github.autopkg.pkg.VLC:
      git_hash: fe5ced1ce7f937d31dc3fb9a8a27e1fa5b2b8961
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/VLC/VLC.pkg.recipe
      sha256_hash: 845212cea5957bb44996f70acba03fb278e8d8d81d68edabb94d64946e734f25
