Identifier: "local.jamf.ElgatoStreamDeck"
Input:
  BUNDLE_ID: "com.elgato.streamdeck"
  CATEGORY: "Apps"
  GROUP_NAME: "%NAME%"
  GROUP_TEMPLATE: "JamfSmartGroupTemplate.xml"
  NAME: "Elgato Stream Deck"
  PACKAGE_INFO: "autopkg"
  POLICY_CATEGORY: "%CATEGORY%"
  POLICY_CUSTOM_TRIGGER: "install-%NAME%"
  POLICY_NAME: "%NAME%"
  POLICY_RUN_COMMAND: " "
  POLICY_RUN_RECON: 'false'
  POLICY_SCOPE_ALL_COMPUTERS: 'true'
  POLICY_TEMPLATE: "JamfPolicyTemplate_allcomputers.xml"
  REMOVE_OLD_PACKAGES: 'true'
  REPLACE_CATEGORY: 'true'
  REPLACE_GROUP: 'true'
  REPLACE_POLICY: 'true'
  SELF_SERVICE_AVAILABLE: 'true'
  SELF_SERVICE_CATEGORY: "%CATEGORY%"
  SELF_SERVICE_DESCRIPTION: "Elgato Stream Deck enhances your workflow with customizable keys for seamless control of apps, streaming, and productivity tools."
  SELF_SERVICE_DISPLAY_NAME: "%NAME%"
  SELF_SERVICE_ICON: "%SOFTWARE_TITLE%.png"
  SELF_SERVICE_INSTALL_BUTTON: "Install"
  SELF_SERVICE_REINSTALL_BUTTON: "Install"
  SOFTWARE_TITLE: "Elgato Stream Deck"
  UPDATE_PREDICATE: "pkg_uploaded == False"

  
ParentRecipe: "com.github.adtejaa.jamf.ElgatoStreamDeck"
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py"
      sha256_hash: "04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e"
    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py"
      sha256_hash: "aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d"
    com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageCleaner.py"
      sha256_hash: "798a179894e6bcc3be65ab6d587bec775e4cfc459956e402f198bb639833365c"
    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py"
      sha256_hash: "0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95"
    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: "febfabb5d43579197a98dd738b85840321c2a369"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py"
      sha256_hash: "5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124"
    com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult:
      git_hash: "793b25dfbe9be8cbc507516d5c8818983357ff5b"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/PostProcessors/LastRecipeRunResult.py"
      sha256_hash: "fcaf0e995aaaa0b633425865546facf544d99b38e5988d5003d33604f27cb9ab"
  parent_recipes:
    com.github.adtejaa.jamf.ElgatoStreamDeck:
      git_hash: "e5d12fb2668ac48c1c1c8a42b86c71996c872839"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/ElagatoStreamDeck/ElgatoStreamDeck.jamf.recipe.yaml"
      sha256_hash: "585df046af603cc6a4983d8c94ba5020554aebea27b9d69ccb76ec5a8211f20d"
    com.github.adtejaa.pkg.ElgatoStreamDeck:
      git_hash: "c2dbdb769578e6db7d574c12b33b5ec38174e58c"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/ElagatoStreamDeck/ElgatoStreamDeck.pkg.recipe.yaml"
      sha256_hash: "3f1e765deeaccc0d1276d2e91b76002704b7326a488645e2ae3d3d1a29a15860"
    com.github.dataJAR-recipes.download.Elgato Stream Deck:
      git_hash: "02642b2c6126df1405cce7db27a76ef364bf178d"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.dataJAR-recipes/Elgato Stream Deck/Elgato Stream Deck.download.recipe"
      sha256_hash: "32b5372a1670fec52bd1e5f5b76080a7ff2eb883d38c5828edbd6b8e5d803bcc"
