Identifier: local.jamf.RStudio
Input:
  APPLICATION_NAME: RStudio.app
  CATEGORY: Apps
  GROUP_NAME: "%NAME%"
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  NAME: RStudio
  PACKAGE_INFO: autopkg
  POLICY_CATEGORY: "%CATEGORY%"
  POLICY_CUSTOM_TRIGGER: install-%NAME%
  POLICY_NAME: "%NAME%"
  POLICY_RUN_COMMAND: " "
  POLICY_RUN_RECON: "false"
  POLICY_SCOPE_ALL_COMPUTERS: "true"
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  POLICY_TRIGGER: Install_RStudio
  REMOVE_OLD_PACKAGES: "true"
  REPLACE_CATEGORY: "true"
  REPLACE_GROUP: "true"
  REPLACE_POLICY: "true"
  SELF_SERVICE_AVAILABLE: "true"
  SELF_SERVICE_CATEGORY: "%CATEGORY%"
  SELF_SERVICE_DESCRIPTION: "RStudio provides open source and enterprise-ready professional software for data science."
  SELF_SERVICE_DISPLAY_NAME: "%NAME%"
  SELF_SERVICE_ICON: "%NAME%.png"
  SELF_SERVICE_INSTALL_BUTTON: Install
  SELF_SERVICE_REINSTALL_BUTTON: Install
  SOFTWARE_TITLE: RStudio
  TESTING_GROUP_NAME: Testing
  UPDATE_PREDICATE: pkg_uploaded == False

ParentRecipe: com.github.adtejaa.jamf.RStudio
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py
      sha256_hash: 04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e
    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py
      sha256_hash: aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d
    com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageCleaner.py
      sha256_hash: 798a179894e6bcc3be65ab6d587bec775e4cfc459956e402f198bb639833365c
    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py
      sha256_hash: 0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95
    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py
      sha256_hash: 5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124
    com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult:
      git_hash: 793b25dfbe9be8cbc507516d5c8818983357ff5b
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/PostProcessors/LastRecipeRunResult.py
      sha256_hash: fcaf0e995aaaa0b633425865546facf544d99b38e5988d5003d33604f27cb9ab
    com.github.homebysix.VersionSplitter/VersionSplitter:
      git_hash: cecb7b4f782a8f6b59f029d30a544df0e07c5548
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/VersionSplitter/VersionSplitter.py
      sha256_hash: 7d465a495dc3c72852472fff64af9adc39fdbd652c612fe862727e4ba78f88c9

  parent_recipes:
    com.github.adtejaa.jamf.RStudio:
      git_hash: d38ba73553ab9061807366df4396bc097bd4e379
      path: ~/Library/AutoPkg/RecipeRepos/com.github.adtejaa.autopkg-recipes/RStudio/RStudio.jamf.recipe.yaml
      sha256_hash: c37ff59e3dfe9583e85f297358893db3303228a76e85e9077e9e6273fd066060
    com.github.novaksam.jamf.RStudio:
      git_hash: a61244e4ab5e9b022e9fddf3c845be1fab4e9bb4
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.novaksam-recipes/RStudio/RStudio.jamf.recipe
      sha256_hash: fc0815e727c095b4d6560c7978f97c2c1bf715fbabb16c715c31945fcab64d75
    com.github.rtrouton.download.RStudio:
      git_hash: ba9a5f8711a0ac69f74ebf48e1f2588f3a4f7c6c
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/RStudio/RStudio.download.recipe
      sha256_hash: f377aba92758b49a84b460f98b5a82591e667f0c463a20449e351f7d3b2e77f5
    com.github.rtrouton.pkg.RStudio:
      git_hash: 84614d29fe664a6afeb95030d8bbbeecb3addca9
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/RStudio/RStudio.pkg.recipe
      sha256_hash: e44b033db1916ad44596e4332f560c0a99e32e2c6326b9ca24bcb65deb3331c6
