Identifier: local.jamf.AndroidStudio
Input:
  CATEGORY: Utilities
  DOWNLOAD_ARCH: mac_arm
  GROUP_NAME: Android Studio-update-smart
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  NAME: Android Studio
  POLICY_CATEGORY: "%CATEGORY%"
  POLICY_NAME: Install Latest %NAME%
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  SEARCH_PATTERN: "(https://redirector\\.gvt1\\.com/edgedl/android/studio/install/.+/android-studio.+%DOWNLOAD_ARCH%\\.dmg)"
  SEARCH_URL: https://developer.android.com/studio
  SELF_SERVICE_DESCRIPTION: Install the latest version of Android Studio.
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_ICON: "Android_Studio.png"
  SUPPORTED_ARCH: arm64
  UPDATE_PREDICATE: pkg_uploaded == False

ParentRecipe: com.github.autopkg.grahampugh-recipes.jamf.AndroidStudio
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.autopkg.novaksam-recipes.Processors/MinimumOSExtractor:
      git_hash: a6d8a60fd9ee8abf1a331ebb9d220d50fc2f284c
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.novaksam-recipes/Processors/MinimumOSExtractor.py
      sha256_hash: 4df6bf8295979ef8f9fc3d6c22596e5418e06a1d1957910e9f7aeb60728aa251
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py
      sha256_hash: 04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e
    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py
      sha256_hash: aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d
    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py
      sha256_hash: 0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95
    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py
      sha256_hash: 5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124
  parent_recipes:
    com.github.autopkg.grahampugh-recipes.jamf.AndroidStudio:
      git_hash: a802b4b5c78a6b87e39db23ab31f34978dcf9772
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/Jamf_Recipes/AndroidStudio.jamf.recipe
      sha256_hash: 17eac28cb89a2b10abe51fc21084c63e32fc4dc57de1c981b9f5c64bee7dbdfe
    com.github.novaksam.download.AndroidStudio:
      git_hash: ab0c6809de10a009da6970a44e5c202be45dc0c8
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.novaksam-recipes/Recipes - Download/AndroidStudio.download.recipe
      sha256_hash: 3b159ba0eab211cb2c0f98b0cec972cfcb4015508e431b40444f829b13fee598
    com.github.novaksam.pkg.AndroidStudio:
      git_hash: 317410696a2577136f9b2d05d28e22f864bd3727
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.novaksam-recipes/Recipes - pkg/AndroidStudio.pkg.recipe
      sha256_hash: 025e9526bfd7005bfb5c6ab0fdbc51eeb83ea08dec25d27ca5bf2c8bb78adcf1
