Identifier: local.jamf.AndroidStudio
Input:
  CATEGORY: Utilities
  DOWNLOAD_ARCH: mac_arm
  NAME: Android Studio
  SEARCH_PATTERN: "(https://redirector\\.gvt1\\.com/edgedl/android/studio/install/.+/android-studio.+%DOWNLOAD_ARCH%\\.dmg)"
  SEARCH_URL: https://developer.android.com/studio
  SUPPORTED_ARCH: arm64
  GROUP_NAME: '%NAME%-update-smart'
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  POLICY_CATEGORY: '%CATEGORY%'
  POLICY_NAME: Install %NAME%
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  SELF_SERVICE_DESCRIPTION: The official IDE for Android app development now accelerates your productivity with Gemini in Android Studio, your AI-powered coding companion.
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_ICON: 'Android_Studio.png'
  UPDATE_PREDICATE: pkg_uploaded == False

ParentRecipe: com.github.autopkg.grahampugh-recipes.jamf.AndroidStudio-pkg-upload
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.autopkg.novaksam-recipes.Processors/MinimumOSExtractor:
      git_hash: a6d8a60fd9ee8abf1a331ebb9d220d50fc2f284c
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.novaksam-recipes/Processors/MinimumOSExtractor.py
      sha256_hash: 4df6bf8295979ef8f9fc3d6c22596e5418e06a1d1957910e9f7aeb60728aa251
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py
      sha256_hash: 04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e
    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py
      sha256_hash: 0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95
  parent_recipes:
    com.github.autopkg.grahampugh-recipes.jamf.AndroidStudio-pkg-upload:
      git_hash: 0fcd574bf1e388a81f6b8c84e0a6f913170721ac
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/Jamf_Package_Upload_Only_Recipes/AndroidStudio-pkg-upload.jamf.recipe
      sha256_hash: 6f2bfdd1c1e795845ed3ab249cc174ff4d8148b2432cb27744ee073ed3ad979c
    com.github.novaksam.download.AndroidStudio:
      git_hash: ab0c6809de10a009da6970a44e5c202be45dc0c8
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.novaksam-recipes/Recipes - Download/AndroidStudio.download.recipe
      sha256_hash: 3b159ba0eab211cb2c0f98b0cec972cfcb4015508e431b40444f829b13fee598
    com.github.novaksam.pkg.AndroidStudio:
      git_hash: 317410696a2577136f9b2d05d28e22f864bd3727
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.novaksam-recipes/Recipes - pkg/AndroidStudio.pkg.recipe
      sha256_hash: 025e9526bfd7005bfb5c6ab0fdbc51eeb83ea08dec25d27ca5bf2c8bb78adcf1
Process:
  - Arguments:
      category_name: "%CATEGORY%"
    Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    replace_category: True

  - Arguments:
      pkg_category: "%CATEGORY%"
    Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader

  - Processor: StopProcessingIf
    Arguments:
      predicate: False

  - Arguments:
      computergroup_name: "%GROUP_NAME%"
      computergroup_template: "%GROUP_TEMPLATE%"
      replace_group: True
    Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader

  - Arguments:
      category_name: "%POLICY_CATEGORY%"
    Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
 
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      icon: "%SELF_SERVICE_ICON%"
      policy_name: "%POLICY_NAME%"
      policy_template: "%POLICY_TEMPLATE%"
      replace_policy: True
   

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: "%NAME%"
      versions_to_keep: 2
